Highcharts.chart('container', {

  title: {
    text: '8間公司2012年-2022年的股市趨勢圖 '
  },

  subtitle: {
    text: '資料來源:鉅亨股市網站'
  },

  yAxis: {
    title: {
      text: '股價'
    }
  },

  xAxis: {categories: ['2012','2013','2014', '2015', '2016', '2017', '2018', '2019','2020','2021','2022']},

  legend: {
    layout: 'vertical',
    align: 'right',
    verticalAlign: 'middle'
  },

  plotOptions: {
    series: {
      label: {
        connectorAllowed: false
      },
            pointStart: 2012
    }
  },

  series: [
  {
    name: '寶成',
    data: [8056.85, 9037.15 , 10980.7 , 10264.7 , 9875.15 , 8622.15 , 9239.55 , 7216.55 , 8221.1 , 228.65 , 6633.95]
  }, 

  {
    name: '凱薩',
    data: [2413.5, 5287.71 , 8342.4 , 8606.3 , 9379.25 , 9684.65 , 9864.1 , 8933.4 , 7639.1 , 8790.45 , 258.65 , ]
  }, 

  {
    name: '廣隆',
    data: [12607.95, 18037.1 , 24103.7 , 30130.8 , 34764.5 , 37783 , 35918.5 , 37686.5 , 34965.5 , 35047 , 967]
  }, 

  {
    name: '泰昇',
    data: [null,null, null,null,null,29900.5, 28183 , 29901 , 30983.5 , 23774 , 609.1]
  }, 

  {
    name: '至興',
    data: [11177.7 , 9876.3 , 11942.8 , 11293.35 , 10357.25 , 10669 , 9650.45 , 7356.5 , 6122.15 , 8006.65 , 169.6]
  },

  {
    name: '伸興',
    data: [25311.6 , 34310 , 39879.5 , 37611.5 , 36341 , 34516.5 , 32891 , 33779 , 32640.5 , 38013 , 1017]
  },

  {
    name: '桂盟',
    data: [11150 , 26807.8 , 32283.5 , 33646 , 28055.5 , 33520.5 , 29948 , 25660.4 , 35737.7 , 51942 , 1399]
  },

  {
    name: '豐泰',
    data: [7230.4 , 13896.3 , 20416.1 , 40209.4 , 35480.5 , 32284 , 39198 , 51906.5 , 42849 , 51837 , 1615.5]
  },
  ],

  responsive: {
    rules: [{
      condition: {
        maxWidth: 1000
      },
      chartOptions: {
        legend: {
          layout: 'horizontal',
          align: 'center',
          verticalAlign: 'bottom'
        }
      }
    }]
  }

});